Core/src/src/InformationRegisters/РетроБонуси/РетроБонуси.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РетроБонуси</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>РетроБонус</name>
    <type>
      <types>CatalogRef.РетроБонусыИПроцентМаркетинговогоБюджета</types>
    </type>
  </resources>
  <resources>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНачало</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>СрокДействияПроцентаРетроБонуса</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Процент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НалогообложениеНДС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентМаркетинговогоБюджета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РозничнаяВесовая</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>АктивностьСправочника</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/src/InformationRegisters/РетроБонуси/Forms/ФормаСписка/Module.bsl
&НаКлиенте
Процедура ЗагрузкаИзФайла(Команда)
	
	АдресЗарплатыВХранилище = ПоместитьЗарплатыВХранилище();
	ПараметрыЗаполнения = Новый Структура("АдресЗарплатыВХранилище", АдресЗарплатыВХранилище);
	
	ОткрытьФорму("РегистрСведений.РетроБонуси.Форма.ФормаЗагрузкеИзТабличногоДокумента",ПараметрыЗаполнения , ЭтаФорма, , , ,Новый ОписаниеОповещения("ЗаполнениеЗарплатыЗавершение", ЭтотОбъект,Новый Структура("АдресЗарплатыВХранилище", АдресЗарплатыВХранилище)) , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервере
Функция ПоместитьЗарплатыВХранилище()
			 
	Возврат ПоместитьВоВременноеХранилище("", УникальныйИдентификатор );
	
КонецФункции

&НаКлиенте
Процедура ЗаполнениеЗарплатыЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    АдресЗарплатыВХранилище = ДополнительныеПараметры.АдресЗарплатыВХранилище;
    
    КодВозврата = Результат;
    
	ЗаполнениеЗарплатыФрагмент(АдресЗарплатыВХранилище, КодВозврата);

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнениеЗарплатыФрагмент(Знач АдресЗарплатыВХранилище, Знач КодВозврата)
	
	ПолучитьЗарплатыИзХранилища(АдресЗарплатыВХранилище);
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьЗарплатыИзХранилища(АдресЗарплатыВХранилище)
			
	//Объект.НачисленияУдержания.Очистить();
	//Объект.НалогиНаДоходы.Очистить();
	//Объект.Удержания.Очистить();

	
	ТаблицаДляЗагрузки = ПолучитьИзВременногоХранилища(АдресЗарплатыВХранилище);
	
	Если  ТаблицаДляЗагрузки <> ""  Тогда 
		
		НаборЗаписей = РегистрыСведений.РетроБонуси.СоздатьНаборЗаписей();
		//НаборЗаписей.Прочитать();	
		

			
		Для Каждого СтрокаТаблицы Из ТаблицаДляЗагрузки Цикл 
				
			//НаборЗаписей = РегистрыСведений.РетроБонуси.СоздатьНаборЗаписей();
			//
			//НаборЗаписей.Отбор.Объект.Установить(СтрокаТаблицы.Период); 
			
				НаборЗаписей.Отбор.Период.Установить(СтрокаТаблицы.Период);
				//НаборЗаписей.Отбор.Контрагент.Установить(СтрокаТаблицы.Контрагент);
				НаборЗаписей.Отбор.Номенклатура.Установить(СтрокаТаблицы.Номенклатура);
				НаборЗаписей.Прочитать();

				НоваяЗапись = НаборЗаписей.Добавить(); 
				
				НоваяЗапись.Период 	   = СтрокаТаблицы.Период; 
				НоваяЗапись.Контрагент = СтрокаТаблицы.Контрагент;  	
				НоваяЗапись.ДоговорКонтрагента = СтрокаТаблицы.Контрагент.ДоговорПоУмолчанию; 				
				НоваяЗапись.Номенклатура	 = СтрокаТаблицы.Номенклатура;	
				
				Если СтрокаТаблицы.Номенклатура.СтавкаНДС = Справочники.СтавкиНДС.НДС18 Тогда 
					НоваяЗапись.НалогообложениеНДС = НСТР("ru = ' НДС 18% '; ka = 'დასაბეგრი'");
				ИначеЕсли  СтрокаТаблицы.Номенклатура.СтавкаНДС = Справочники.СтавкиНДС.ОсвобожденОтНДС Тогда 
					НоваяЗапись.Номенклатура.НалогообложениеНДС = НСТР("ru = 'Освобожден от НДС'; ka = 'დაუბეგრავი'");		
				ИначеЕсли  СтрокаТаблицы.Номенклатура.СтавкаНДС = Справочники.СтавкиНДС.БезНДС Тогда 
					НоваяЗапись.НалогообложениеНДС = НСТР("ru = '(-)'; ka = '(-)'");
				Иначе 
					НоваяЗапись.НалогообложениеНДС = НСТР("ru = '(-)'; ka = '(-)'");
				КонецЕсли;
								
				НоваяЗапись.РозничнаяВесовая = СтрокаТаблицы.РозничнаяВесовая;	
				НоваяЗапись.ПроцентМаркетинговогоБюджета = СтрокаТаблицы.ПроцентМаркетинговогоБюджета;
				НоваяЗапись.Процент = СтрокаТаблицы.ПроцентРетробонуса;
				НоваяЗапись.Активность = Истина ;
				НоваяЗапись.АктивностьРетроБонуса = Истина ;	
				НаборЗаписей.Записать();
			
		КонецЦикла;
		
		//НаборЗаписей.Записать();
		
		
		//РаспределитьНДФЛ();
		//ОбновитьПодвалФормы();
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;

	
КонецПроцедуры
